In [1]:
import pandas as pd
import numpy as np

In [4]:
#los DataFrame son la estructura de datos mas importante en pandas
#la base para la mayoria de herramientas para analisis de datos
#escencialmente es una tabla
#filas y columnas donde las columnas son series de datos
#similar a base de datos o hojas de calculos

#crear un data frame con vase a diccionarios
data =[
    {"Nombre": "Ana", "Edad": 25, "City": "Madrid"},
    {"Nombre": "Luis", "Edad": 30, "City": "Barcelona"},
    {"Nombre": "Pedro", "Edad": 22, "City": "Valencia"}
]

df = pd.DataFrame(data)
df

  Nombre  Edad       City
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia

In [6]:
#puedo hacer un Data Frame a travez de un diccionario de listas
data = {
    "Nombre": ["Ana","Luis","Pedro","Marta"],
    "Edad": [25,30,22,29],
    "City": ["Madrid","Barcelona","Valencia","Sevilla"]
}

df = pd.DataFrame(data)
df

  Nombre  Edad       City
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia
3  Marta    29    Sevilla

In [7]:
#operaciones basicas con data frame
##seleccionar columnas
nombres = df["Nombre"]
nombres

0      Ana
1     Luis
2    Pedro
3    Marta
Name: Nombre, dtype: object

In [23]:
##añadir columnas
df["salario"]=[30000,40000,25000,35000]
df
#se debe respetar los elementos que hay

  Nombre  Edad       City  salario
0    Ana    25     Madrid    30000
1   Luis    30  Barcelona    40000
2  Pedro    22   Valencia    25000
3  Marta    29    Sevilla    35000

In [10]:
#borrar columnas
df.drop("salario", axis=1,inplace=True)
df

  Nombre  Edad       City
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia
3  Marta    29    Sevilla

In [12]:
#seleccionar una fila 
primera_fila = df.iloc[0]
primera_fila
#genera objetos

Nombre       Ana
Edad          25
City      Madrid
Name: 0, dtype: object

In [19]:
#seleccionar filas por condicion que cumplan
df.loc[df["Edad"] < 30]
#puede ser para los nombres tambien

  Nombre  Edad      City
0    Ana    25    Madrid
2  Pedro    22  Valencia
3  Marta    29   Sevilla

In [21]:
#ordenar el dataframe
df.sort_values(by="Edad", ascending=True) #ordena por edades y que tipo de orden

  Nombre  Edad       City
2  Pedro    22   Valencia
0    Ana    25     Madrid
3  Marta    29    Sevilla
1   Luis    30  Barcelona

In [22]:
#operaciones estadisticas 
df["Edad"].mean()
df["Edad"].max()
df["Edad"].min()

np.int64(22)

In [24]:
#operaciones en datos vacios
#creacion nuevamente de dataframe
data = {
    "Nombre": ["Ana",None,"Pedro","Marta"],
    "Edad": [25,30,22,None],
    "City": ["Madrid","Barcelona",None,"Sevilla"]
}

df = pd.DataFrame(data)
##añadir columnas
df["salario"]=[30000,40000,25000,None]
df

  Nombre  Edad       City  salario
0    Ana  25.0     Madrid  30000.0
1   None  30.0  Barcelona  40000.0
2  Pedro  22.0       None  25000.0
3  Marta   NaN    Sevilla      NaN

In [26]:
#eliminar elementos vacios
df.dropna()
#solo saldra quien tenga todos los campos llenos

  Nombre  Edad    City  salario
0    Ana  25.0  Madrid  30000.0

In [31]:
#colocar en los vacios un elemento deseado
df.fillna(value={"Edad":0, "City": "N/A"})
#sin modificar df

  Nombre  Edad       City  salario
0    Ana  25.0     Madrid  30000.0
1   None  30.0  Barcelona  40000.0
2  Pedro  22.0        N/A  25000.0
3  Marta   0.0    Sevilla      NaN